",|Punctuation (comma) used to separate entries in a list of names. Example: Alice, Bob, Carol" = ",";

"Add|generic add button" = "เพิ่ม";

"Cancel|generic cancel button" = "ยกเลิก";

"Facebook Messages|Title of button on sheet allowing user to contact a friend via Facebook Messages" = "Facebook Messages";

"Facebook User|Placeholder name for Facebook user whose name is unknown" = "ผู้ใช้ Facebook";

"Friends or Contacts|placeholder text in to field of contacts picker" = "เพื่อนหรือผู้ติดต่อ";

"Group Conversation|Label at top of online friends list that takes user to new message composer" = "การสนทนาแบบกลุ่ม";

"Incomplete contact|Alert title: Newly created contact needs more information" = "ข้อมูลผู้ติดต่อไม่ครบ";

"Invalid Contact|Alert title: Newly created contact has invalid information" = "ผู้ติดต่อไม่ถูกต้อง";

"Last Updated: %@|last updated date in pull to refresh header" = "อัพเดตล่าสุด: %1$@";

"Loading...|loading progress text" = "กำลังโหลด...";

"More Online Friends|Table title: More friends who are online (but are not top ranked friends)" = "เพื่อนที่ออนไลน์เพิ่มเติม";

"Name|Placeholder text: Name of new contact" = "ชื่อ";

"New Contact|Button title: Create a new contact" = "ผู้ติดต่อใหม่";

"OK|generic affirmative button" = "ตกลง";

"on mobile|presences status for being available on mobile" = "บนมือถือ";

"online|presences status for being online on the web" = "ออนไลน์";

"Phone or Email|Placeholder text: Phone or email address of new contact" = "โทรศัพท์หรืออีเมล";

"Please enter a phone number or email.|Alert message: Newly created contact has invalid information" = "โปรดป้อนเบอร์โทรศัพท์หรืออีเมล";

"Please enter the person's name and contact information.|Alert message: Newly created contact needs more information" = "โปรดป้อนชื่อบุคคลและข้อมูลการติดต่อ";

"Pull down to refresh...|message for pull down to refresh" = "กดลงเพื่อรีเฟรช...";

"Push up to refresh...|message for push up to refresh" = "กดขึ้นเพื่อรีเฟรช...";

"Release to refresh...|message for releasing to refresh" = "ปล่อยปุ่มเพื่อรีเฟรช...";

"Search|placeholder in search bar" = "ค้นหา";

"Search for More Friends…|Label at bottom of online friends list that lets user search for more friends" = "ค้นหาเพื่อนเพิ่มเติม…";

"Send to:|Title of sheet shown when sending to a user with multiple points of contact" = "ส่งถึง:";

"To:|to field in contact picker" = "ถึง:";

"Updating...|updating progress text" = "กำลังอัพเดต...";

